<?php

namespace Database\Seeders;

use App\Models\Advert;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class AdvertSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Advert::insert([
            'title' => 'ІПОТЕКА 3%, СЕРТИФІКАТ! Продаж квартири 93 м2 в новобудові в центрі',
            'description' => 'Пропоную трикімнатну квартиру вільного планування,' .
                'на десятому поверсі нової одинадцятиповерхівки 2019 року побудови, '.
                'за адресою проспект Перемоги 60 (поруч з видавництвом Деснянська правда). ' .
                'Шикарна локація. Квартира з індивідуальним газовим опаленням (двохконтурний котел), ' .
                'великою кухнею, об\'єднаною з однією з кімнат, двома просторими лоджіями і мальовничим ' .
                'краєвидом на місто. Загальна площа 92.5 м2. Встановлені домофон, газовий котел, ' .
                'опалювальна система, лічильники, стан після будівельників, є можливість втілити ' .
                'власне бачення дизайну та планування. Прописаних немає, підходить під програму ' .
                'єОСЕЛЯ (іпотека під 3%). Для перегляду завчасно зв\'язуйтесь за вказаним номером. ' .
                'Цифри обговорюються, усі торги після перегляду.',
            'views' => '0',
            'price' => '2880000',
            'user_id' => '1',
            'category_id' => '1',
            'city_id' => '2',
        ]);
        Advert::insert([
            'title' => '1 кімнатна квартира 50м2, 4/10 з автономкою в новому будинку ЖК Незалежність',
            'description' => '1 кімнатна квартира 50м2, 4/10 з автономкою в новому будинку ЖК Незалежність '.
                'Квартира знаходиться на 4 поверсі 10-ти поверхового цегляного будинку. Загальна площа квартири – 50 м2, кухня – 14 м2. Не кутова. Стан квартири під чистову обробку '.
                'Вирішили купити 1 кімнатну квартиру - зверніть увагу '.
                '1. Будинок вже введений в експлуатацію, Ви можете купувати квартиру та одразу розпочинати ремонт Вашої мрії, не відкладаючи це питання на невизначений термін '.
                '2. У квартирі індивідуальне опалення (двоконтурний газовий котел), що дозволяє Вам регулювати опалення в квартирі як Вам буде необхідно '.
                '3. Будинок побудований з білої цегли і додатково утеплений по фасаду для максимальної енергоефективності '.
                '4. У квартирі зроблено: '.
                '-металопластикові вікна '.
                '-нові радіатори опалення '.
                '-залита підлога, тепла підлога в передпокої, в санвузлі та на кухні '.
                '-зроблена штукатурка стін '.
                '-виконано розведення електрики по квартирі '.
                '-металеві вхідні двері '.
                '5. Територія біля будинку закритого типу, будуть свої дитячі майданчики, зони відпочинку з фонтаном та прибудинкова парковка '.
                'Зручне розташування - в кроковій доступності від будинку: '.
                '- зупинки громадського транспорту '.
                '- ринок на "Масанах" '.
                '- супермаркети "Велмарт", "АТБ", "Квартал" та "Сідам" '.
                '- школа №35 '.
                '- дитячий садок №75, №3 '.
                'Не відкладайте дзвінок на завтра. Вам можуть відповісти – Продано!',
            'views' => '0',
            'price' => '1480000',
            'user_id' => '2',
            'category_id' => '1',
            'city_id' => '2',
        ]);
        Advert::insert([
            'title' => '3-ком. Трц Голливуд.',
            'description' => 'Квартира возле ТРЦ Голливуда. '.
                'Все есть в Шаговой доступности. '.
                'Панорамный вид на город. '.
                'Дверь входная Металлическая. '.
                'Счётчики на воду. '.
                'Балкон и лоджия есть. '.
                'Окна деревянные. '.
                'Требует ремонта особенно санузел. '.
                'Квартира для тех кто хочет создать свой авторский ремонт, и жить на центральной улице где есть кафе магазины. '.
                '80684009751',
            'views' => '0',
            'price' => '1560000',
            'user_id' => '3',
            'category_id' => '1',
            'city_id' => '2',
        ]);
    }
}
